
dic={'320100':'南京市','320101':'南京市市辖区','320102':'南京市玄武区','320103':'南京市白下区','320104':'南京市秦淮区','320105':'南京市建邺区','320106':'南京市鼓楼区','320107':'南京市下关区',  '320111':'南京市浦口区','320113':'南京市栖霞区','320114':'南京市雨花台区','320115':'南京市江宁区','320116':'南京市六合区','320124':'南京市溧水区','320125':'南京市高淳区'  }
def idget(str):
    newstr='' 
    if dic.get(str):
         newstr=dic[str]
    return newstr
instr=input('请输入您的身份证号:\n')
 
if instr[:16].isdigit()and len(instr) == 18:
    print('你来自:',idget(instr[0:6]))
    print('你的生日是:' + instr[6:10] + '年' +instr [10:12] + '月' + instr[12:14] + '日')
    gender = '女' if int(instr[16]) % 2 == 0 else '男'
    print('你的性别是:' + gender )
    

